<details ><summary>apply for ruby-getting-started-terraform 2025-12-30 03:35:14 (UTC)</summary>
    <details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # aws_s3_bucket.rds_backup will be created
  + resource "aws_s3_bucket" "rds_backup" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "ruby-getting-started-rds-backup"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started RDS Backup Bucket"
          + "Project"     = "ruby-getting-started"
          + "Purpose"     = "RDS Database Backups"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started RDS Backup Bucket"
          + "Project"     = "ruby-getting-started"
          + "Purpose"     = "RDS Database Backups"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.rds_backup will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "rds_backup" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "delete-old-backups"
          + status = "Enabled"

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # aws_s3_bucket_policy.rds_backup will be created
  + resource "aws_s3_bucket_policy" "rds_backup" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.rds_backup will be created
  + resource "aws_s3_bucket_public_access_block" "rds_backup" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.rds_backup will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "rds_backup" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.rds_backup will be created
  + resource "aws_s3_bucket_versioning" "rds_backup" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.github_oidc.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ description           = "Role for GitHub Actions OIDC" -> "Role for GitHub Actions OIDC - ruby-getting-started"
        id                    = "ruby-getting-started-terraform-github-actions-role"
        name                  = "ruby-getting-started-terraform-github-actions-role"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.github_oidc.aws_iam_role_policy_attachment.attach[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "attach" {
      ~ id         = "ruby-getting-started-terraform-github-actions-role-20251229015150180200000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess" -> "arn:aws:iam::aws:policy/IAMFullAccess" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.github_oidc.aws_iam_role_policy_attachment.attach[1] will be created
  + resource "aws_iam_role_policy_attachment" "attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      + role       = "ruby-getting-started-terraform-github-actions-role"
    }

  # module.github_oidc.aws_iam_role_policy_attachment.attach[2] will be created
  + resource "aws_iam_role_policy_attachment" "attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonVPCFullAccess"
      + role       = "ruby-getting-started-terraform-github-actions-role"
    }

  # module.github_oidc.aws_iam_role_policy_attachment.attach[3] will be created
  + resource "aws_iam_role_policy_attachment" "attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2FullAccess"
      + role       = "ruby-getting-started-terraform-github-actions-role"
    }

  # module.github_oidc.aws_iam_role_policy_attachment.attach[4] will be created
  + resource "aws_iam_role_policy_attachment" "attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonRDSFullAccess"
      + role       = "ruby-getting-started-terraform-github-actions-role"
    }

Plan: 11 to add, 1 to change, 1 to destroy.
module.github_oidc.aws_iam_role_policy_attachment.attach[0]: Destroying... [id=ruby-getting-started-terraform-github-actions-role-20251229015150180200000001]
aws_s3_bucket.rds_backup: Creating...

```
</details>

<details ><summary>Error during applying.</summary>
  exit status 1
</details>

</details>